%Coefficients (with 95% confidence bounds):
%x = input('请输入光轴倾角');
x = linspace(0,0.00008,40000);
a0 =   7.363e-05 ;% (7.347e-05, 7.379e-05)
a1 =  -8.187e-05 ;%(-8.207e-05, -8.167e-05);
b1 =  -2.305e-05 ; %(-2.31e-05, -2.3e-05);
a2 =   7.352e-06 ; %(7.3e-06, 7.403e-06);
b2 =   1.373e-05 ; %(1.372e-05, 1.375e-05);
a3 =   9.547e-07 ; %(9.457e-07, 9.637e-07);
b3 =  -1.768e-06 ; %(-1.773e-06, -1.762e-06);
w =       1.798  ; %(1.795, 1.801);
S21output =  a0 + a1.*cos(x*w) + b1.*sin(x*w) + a2.*cos(2*x*w) + b2.*sin(2*x*w) + a3.*cos(3*x*w) + b3.*sin(3*x*w);
plot(x,S21output);
%fprintf ('应变量为%f',S21output)